{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_1/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_1/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_1/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_1/moving_variance", "shape": [128]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "bidirectional_1/forward_lstm_1/kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_1/forward_lstm_1/bias", "shape": [512]}, {"dtype": "float32", "name": "bidirectional_1/backward_lstm_1/kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_1/backward_lstm_1/bias", "shape": [512]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "bidirectional_2/forward_lstm_2/kernel", "shape": [256, 512]}, {"dtype": "float32", "name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_2/forward_lstm_2/bias", "shape": [512]}, {"dtype": "float32", "name": "bidirectional_2/backward_lstm_2/kernel", "shape": [256, 512]}, {"dtype": "float32", "name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "bidirectional_2/backward_lstm_2/bias", "shape": [512]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "time_distributed_1/kernel", "shape": [3, 1, 32]}, {"dtype": "float32", "name": "time_distributed_1/bias", "shape": [32]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "time_distributed_2/kernel", "shape": [3, 32, 32]}, {"dtype": "float32", "name": "time_distributed_2/bias", "shape": [32]}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "name": "time_distributed_5/kernel", "shape": [256, 25]}, {"dtype": "float32", "name": "time_distributed_5/bias", "shape": [25]}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "epsilon": 1e-08, "decay": 0.0, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "sample_weight_mode": null, "loss_weights": null, "loss": "categorical_crossentropy"}, "backend": "tensorflow", "model_config": {"config": [{"config": {"trainable": true, "dtype": "float32", "layer": {"config": {"padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv1d_1", "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3]}, "class_name": "Conv1D"}, "name": "time_distributed_1", "batch_input_shape": [null, 32, 12, 1]}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "time_distributed_2", "layer": {"config": {"padding": "valid", "use_bias": true, "kernel_regularizer": null, "name": "conv1d_2", "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3]}, "class_name": "Conv1D"}}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "time_distributed_3", "layer": {"config": {"trainable": true, "padding": "valid", "strides": [2], "pool_size": [2], "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "time_distributed_4", "layer": {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}}, "class_name": "TimeDistributed"}, {"config": {"scale": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "layer": {"config": {"stateful": false, "return_sequences": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "use_bias": true, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "name": "lstm_1", "go_backwards": false, "implementation": 1, "unroll": false}, "class_name": "LSTM"}, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "layer": {"config": {"stateful": false, "return_sequences": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "use_bias": true, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "name": "lstm_2", "go_backwards": false, "implementation": 1, "unroll": false}, "class_name": "LSTM"}, "name": "bidirectional_2", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "time_distributed_5", "layer": {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 25, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "class_name": "Sequential"}, "keras_version": "2.1.2"}}