{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [144], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [144], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [144, 256], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [144, 256], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "bidirectional_2/forward_lstm_2/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "time_distributed_1/kernel", "shape": [1, 12], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "time_distributed_3/kernel", "shape": [128, 25], "dtype": "float32"}, {"name": "time_distributed_3/bias", "shape": [25], "dtype": "float32"}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss_weights": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "decay": 0.0, "amsgrad": false, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "sample_weight_mode": null}, "keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"batch_input_shape": [null, 32, 12, 1], "layer": {"config": {"activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "units": 12, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, "trainable": true, "name": "time_distributed_1", "dtype": "float32"}, "class_name": "TimeDistributed"}, {"config": {"layer": {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, "trainable": true, "name": "time_distributed_2"}, "class_name": "TimeDistributed"}, {"config": {"momentum": 0.99, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"merge_mode": "concat", "layer": {"config": {"return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "unit_forget_bias": true, "units": 64, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "unroll": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dropout": 0.0}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_1"}, "class_name": "Bidirectional"}, {"config": {"merge_mode": "concat", "layer": {"config": {"return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "unit_forget_bias": true, "units": 64, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "unroll": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dropout": 0.0}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_2"}, "class_name": "Bidirectional"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"layer": {"config": {"activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "units": 25, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, "trainable": true, "name": "time_distributed_3"}, "class_name": "TimeDistributed"}], "class_name": "Sequential"}}}